#include <iostream>
using namespace std;

int main() {
    unsigned int x = 5; // 0000 0101

    // Побітове І й присвоєння
    x &= 3; // 0000 0011
    cout << "x &= 3: " << x << endl; // Виведе: x &= 3: 3

    // Побітове АБО й присвоєння
    x |= 9; // 0000 1011
    cout << "x |= 9: " << x << endl; // Виведе: x |= 9: 11

    // Побітове виключне АБО й присвоєння
    x ^= 5; // 0000 0101
    cout << "x ^= 5: " << x << endl; // Виведе: x ^= 5: 5

    // Побітовий зсув вліво й присвоєння
    x <<= 2; // 0001 0100
    cout << "x <<= 2: " << x << endl; // Виведе: x <<= 2: 20

    // Побітовий зсув вправо й присвоєння
    x >>= 1; // 0000 1010
    cout << "x >>= 1: " << x << endl; // Виведе: x >>= 1: 10

    return 0;
}
